Added index.md to support mkdocs aggregation, minor accuracy changes (#41)
* Added index.md to support mkdocs aggregation, minor accuracy changes

* updates to remove planned features, clean up docs, convert ascii charts to mermaid

---------

Co-authored-by: alan runyan <runyaga@gmail.com>
